PPR/src/Documents/ОказаниеУслуги/ОказаниеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОказаниеУслуги</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Мастер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

PPR/src/Documents/ОказаниеУслуги/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
    //{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
    Макет = Документы.ОказаниеУслуги.ПолучитьМакет("Печать");
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ОказаниеУслуги.Дата,
    |	ОказаниеУслуги.Клиент,
    |	ОказаниеУслуги.Мастер,
    |	ОказаниеУслуги.Номер,
    |	ОказаниеУслуги.Склад,
    |	ОказаниеУслуги.ПереченьНоменклатуры.(
    |		НомерСтроки,
    |		Номенклатура,
    |		Количество,
    |		Цена,
    |		Сумма
    |	)
    |ИЗ
    |	Документ.ОказаниеУслуги КАК ОказаниеУслуги
    |ГДЕ
    |	ОказаниеУслуги.Ссылка В (&Ссылка)";
    Запрос.Параметры.Вставить("Ссылка", Ссылка);
    Выборка = Запрос.Выполнить().Выбрать();

    ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
    Шапка = Макет.ПолучитьОбласть("Шапка");
    ОбластьПереченьНоменклатурыШапка = Макет.ПолучитьОбласть("ПереченьНоменклатурыШапка");
    ОбластьПереченьНоменклатуры = Макет.ПолучитьОбласть("ПереченьНоменклатуры");
    
    // {{ Ковтун С. В. доработка начало
        ОбластьИтог = Макет.ПолучитьОбласть("Всего");
    // }} Ковтун С. В. доработка конец 

    ТабДок.Очистить();

    ВставлятьРазделительСтраниц = Ложь;           
    
    // {{ Ковтун С. В. доработка начало
        СуммаИтог = 0;
    // }} Ковтун С. В. доработка конец 
    
    Пока Выборка.Следующий() Цикл
        Если ВставлятьРазделительСтраниц Тогда
            ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли;

        ТабДок.Вывести(ОбластьЗаголовок);

        Шапка.Параметры.Заполнить(Выборка);
        ТабДок.Вывести(Шапка, Выборка.Уровень());

        ТабДок.Вывести(ОбластьПереченьНоменклатурыШапка);
        ВыборкаПереченьНоменклатуры = Выборка.ПереченьНоменклатуры.Выбрать();
        Пока ВыборкаПереченьНоменклатуры.Следующий() Цикл
            ОбластьПереченьНоменклатуры.Параметры.Заполнить(ВыборкаПереченьНоменклатуры);
            ТабДок.Вывести(ОбластьПереченьНоменклатуры, ВыборкаПереченьНоменклатуры.Уровень());
            
            // {{ Ковтун С. В. доработка начало
                СуммаИтог = СуммаИтог + ВыборкаПереченьНоменклатуры.Сумма;
            // }} Ковтун С. В. доработка конец 
            
        КонецЦикла;                                                      
        
        // {{ Ковтун С. В. доработка начало
            ОбластьИтог.Параметры.ВсегоПоДокументу = СуммаИтог;
            ТабДок.Вывести(ОбластьИтог);
        // }} Ковтун С. В. доработка конец
        

        ВставлятьРазделительСтраниц = Истина;
    КонецЦикла;
    //}}
КонецПроцедуры
